#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.discord_simde.data.discord_color.admin: Refreshing state... [id=8856069]
module.discord_simde.data.discord_permission.base_permissions: Refreshing state... [id=2344433856]
module.discord_simde.data.discord_color.jeffrey: Refreshing state... [id=14737408]
module.discord_simde.data.discord_local_image.logo: Refreshing state... [id=3392118645]
module.discord_simde.data.discord_color.treso: Refreshing state... [id=14737408]
module.discord_simde.data.discord_color.payutc: Refreshing state... [id=14737408]
module.discord_simde.data.discord_color.respinfo: Refreshing state... [id=4360181]
module.github.module.maxime-vaillant.data.github_user.user: Refreshing state... [id=65608587]
module.discord_simde.data.discord_color.member: Refreshing state... [id=4360181]
module.github.module.huetremy.data.github_user.user: Refreshing state... [id=32484913]
module.github.module.maxime-vaillant.github_membership.membership: Refreshing state... [id=SiMDE-Projects:maxime-vaillant]
module.github.github_repository.terraform: Refreshing state... [id=terraform]
module.github.module.anto2oo.data.github_user.user: Refreshing state... [id=17387249]
module.github.module.noeamiot.github_membership.membership: Refreshing state... [id=SiMDE-Projects:noeamiot]
module.github.module.cesar-richard.github_membership.membership: Refreshing state... [id=SiMDE-Projects:cesar-richard]
module.github.module.huetremy.github_membership.membership: Refreshing state... [id=SiMDE-Projects:huetremy]
module.github.github_team.simde: Refreshing state... [id=4217733]
module.github.module.matthieudecaux.github_membership.membership: Refreshing state... [id=SiMDE-Projects:matthieudecaux]
module.github.module.noeamiot.data.github_user.user: Refreshing state... [id=25272468]
module.github.data.github_branch.jeffreyApi_master: Refreshing state...
module.github.github_repository.jeffrey: Refreshing state... [id=jeffrey]
module.github.module.cesar-richard.data.github_user.user: Refreshing state... [id=5199868]
module.github.github_team.jeffrey: Refreshing state... [id=4211302]
module.github.data.github_branch.jeffrey_master: Refreshing state...
module.github.github_repository.jeffreyApi: Refreshing state... [id=jeffrey-api]
module.github.module.matthieudecaux.data.github_user.user: Refreshing state... [id=74496909]
module.github.data.github_branch.terraform_main: Refreshing state...
module.github.github_team.flairsou: Refreshing state... [id=4276153]
module.github.github_repository.flairsou: Refreshing state... [id=flairsou]
module.github.module.anto2oo.github_membership.membership: Refreshing state... [id=SiMDE-Projects:anto2oo]
module.discord_simde.data.discord_permission.allow: Refreshing state... [id=1236542892]
module.discord_simde.data.discord_permission.member: Refreshing state... [id=2906567963]
module.discord_simde.data.discord_permission.readonly: Refreshing state... [id=3747141497]
module.discord_simde.data.discord_permission.deny: Refreshing state... [id=4262583481]
module.discord_simde.data.discord_permission.admin: Refreshing state... [id=3595142127]
module.discord_simde.discord_server.server: Refreshing state... [id=759778767831957535]
module.github.github_issue_label.terraform_applied: Refreshing state... [id=terraform:Applied]
module.github.github_issue_label.terraform_toApply: Refreshing state... [id=terraform:To Apply]
module.github.github_team_repository.simde_terraform: Refreshing state... [id=4217733:terraform]
module.github.github_branch_protection.terraform_main: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTY5OTk=]
module.github.github_repository_project.jeffrey_main: Refreshing state... [id=5787333]
module.github.github_team_repository.simde_jeffrey: Refreshing state... [id=4217733:jeffrey]
module.github.github_branch_protection.jeffrey_master: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTY5NjU=]
module.github.github_team_repository.jeffrey_jeffrey: Refreshing state... [id=4211302:jeffrey]
module.github.github_team_repository.simde_jeffreyApi: Refreshing state... [id=4217733:jeffrey-api]
module.github.github_repository_project.jeffreyApi_main: Refreshing state... [id=5787347]
module.github.github_branch_protection.jeffreyApi_master: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTY5NjY=]
module.github.github_team_repository.jeffrey_jeffreyApi: Refreshing state... [id=4211302:jeffrey-api]
module.discord_simde.discord_role.respinfo: Refreshing state... [id=781934406292996116]
module.discord_simde.discord_role_everyone.everyone: Refreshing state... [id=759778767831957535]
module.github.github_repository_project.flairsou_main: Refreshing state... [id=5920244]
module.github.github_team_repository.simde_flairsou: Refreshing state... [id=4217733:flairsou]
module.github.github_branch_protection.flairsou_master: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTcwMDE=]
module.github.github_team_repository.flairsou: Refreshing state... [id=4276153:flairsou]
module.github.module.cesar-richard.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:cesar-richard]
module.github.module.cesar-richard.github_team_membership.membership["simde"]: Refreshing state... [id=4217733:cesar-richard]
module.github.module.anto2oo.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:anto2oo]
module.github.module.maxime-vaillant.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:maxime-vaillant]
module.github.module.noeamiot.github_team_membership.membership["jeffrey"]: Refreshing state... [id=4211302:noeamiot]
module.github.module.noeamiot.github_team_membership.membership["simde"]: Refreshing state... [id=4217733:noeamiot]
module.discord_simde.module.general.discord_category_channel.category: Refreshing state... [id=778331758302593074]
module.discord_simde.module.noe_amiot.data.discord_member.member: Refreshing state... [id=301424363624857600]
module.discord_simde.discord_role.member: Refreshing state... [id=759778776560828447]
module.discord_simde.module.maxime_vaillant.data.discord_member.member: Refreshing state... [id=611205176493342752]
module.discord_simde.module.BWRCat.data.discord_member.member: Refreshing state... [id=273139242614652938]
module.discord_simde.module.antoine_cet.data.discord_member.member: Refreshing state... [id=621730232365482004]
module.discord_simde.module.anton42.data.discord_member.member: Refreshing state... [id=301703000508989440]
module.discord_simde.module.lucas_richard.data.discord_member.member: Refreshing state... [id=486146533083971605]
module.discord_simde.module.matthieu_decaux.data.discord_member.member: Refreshing state... [id=772064855636836402]
module.discord_simde.module.cesar_richard.data.discord_member.member: Refreshing state... [id=463652129878573056]
module.discord_simde.module.armand_ribault.data.discord_member.member: Refreshing state... [id=418537351858487297]
module.discord_simde.module.remy_huet.data.discord_member.member: Refreshing state... [id=327723660259360768]
module.discord_simde.module.victor_ronfaut.data.discord_member.member: Refreshing state... [id=166621029412765696]
module.github.module.matthieudecaux.github_team_membership.membership["flairsou"]: Refreshing state... [id=4276153:matthieudecaux]
module.github.module.huetremy.github_team_membership.membership["flairsou"]: Refreshing state... [id=4276153:huetremy]
module.github.github_project_column.jeffrey_main_doing: Refreshing state... [id=11462385]
module.github.github_project_column.jeffrey_main_done: Refreshing state... [id=11462393]
module.github.github_project_column.jeffrey_main_todo: Refreshing state... [id=11462387]
module.github.github_project_column.jeffrey_main_codeReview: Refreshing state... [id=11462392]
module.github.github_project_column.jeffrey_main_approved: Refreshing state... [id=11541989]
module.github.github_project_column.jeffreyApi_main_approved: Refreshing state... [id=11541988]
module.github.github_project_column.jeffreyApi_main_doing: Refreshing state... [id=11462394]
module.github.github_project_column.jeffreyApi_main_done: Refreshing state... [id=11462386]
module.github.github_project_column.jeffreyApi_main_codeReview: Refreshing state... [id=11462396]
module.github.github_project_column.jeffreyApi_main_todo: Refreshing state... [id=11462388]
module.github.github_project_column.flairsou_main_done: Refreshing state... [id=11726484]
module.github.github_project_column.flairsou_main_todo: Refreshing state... [id=11726487]
module.github.github_project_column.flairsou_main_approved: Refreshing state... [id=11726488]
module.github.github_project_column.flairsou_main_doing: Refreshing state... [id=11726485]
module.github.github_project_column.flairsou_main_codeReview: Refreshing state... [id=11726486]
module.discord_simde.module.general.discord_text_channel.text: Refreshing state... [id=759903967211028490]
module.discord_simde.discord_role.jeffrey: Refreshing state... [id=782684806961561660]
module.discord_simde.module.lucas_richard.discord_member_roles.member_role["781934406292996116"]: Refreshing state... [id=1486613506]
module.discord_simde.discord_text_channel.games: Refreshing state... [id=781925726840553514]
module.discord_simde.module.general.discord_voice_channel.voice: Refreshing state... [id=778331765487960074]
module.discord_simde.discord_text_channel.notifications: Refreshing state... [id=778636669737369651]
module.discord_simde.module.armand_ribault.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=693075349]
module.discord_simde.module.BWRCat.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=1961962676]
module.discord_simde.module.antoine_cet.discord_member_roles.member_role["781934406292996116"]: Refreshing state... [id=4264886267]
module.discord_simde.discord_role.treso: Refreshing state... [id=777569554539741255]
module.discord_simde.discord_invite.general: Refreshing state... [id=sPnWyht]
module.discord_simde.module.private-treso.discord_category_channel.category: Refreshing state... [id=778331760605528146]
module.discord_simde.module.anton42.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=2772452286]
module.discord_simde.module.anton42.discord_member_roles.member_role["782684806961561660"]: Refreshing state... [id=2772452286]
module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=2801032487]
module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["782684806961561660"]: Refreshing state... [id=2801032487]
module.discord_simde.discord_role.payutc: Refreshing state... [id=776093666267758604]
module.discord_simde.module.remy_huet.discord_member_roles.member_role["777569554539741255"]: Refreshing state... [id=334888942]
module.discord_simde.module.remy_huet.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=334888942]
module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role["777569554539741255"]: Refreshing state... [id=2713721276]
module.discord_simde.module.private-treso.discord_text_channel.text: Refreshing state... [id=777569555114885140]
module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=2713721276]
module.discord_simde.discord_role.admin: Refreshing state... [id=759778778212991066]
module.discord_simde.module.private-treso.discord_voice_channel.voice: Refreshing state... [id=778331766838394880]
module.discord_simde.discord_invite.treso: Refreshing state... [id=JHanp36mGb]
module.discord_simde.module.private-payutc.discord_category_channel.category: Refreshing state... [id=778331763218972724]
module.discord_simde.module.noe_amiot.discord_member_roles.member_role["776093666267758604"]: Refreshing state... [id=1422878723]
module.discord_simde.module.noe_amiot.discord_member_roles.member_role["759778778212991066"]: Refreshing state... [id=1422878723]
module.discord_simde.module.cesar_richard.discord_member_roles.member_role["759778776560828447"]: Refreshing state... [id=758910205]
module.discord_simde.module.cesar_richard.discord_member_roles.member_role["759778778212991066"]: Refreshing state... [id=758910205]
module.discord_simde.module.cesar_richard.discord_member_roles.member_role["776093666267758604"]: Refreshing state... [id=758910205]
module.discord_simde.discord_channel_permission.respinfo_notifications: Refreshing state... [id=2712721542]
module.discord_simde.discord_channel_permission.respinfo_general: Refreshing state... [id=197882345]
module.discord_simde.discord_channel_permission.treso_general: Refreshing state... [id=2076131544]
module.discord_simde.discord_channel_permission.payutc_general: Refreshing state... [id=2210266031]
module.discord_simde.discord_channel_permission.payutc_notifications: Refreshing state... [id=700863168]
module.discord_simde.discord_channel_permission.treso_treso: Refreshing state... [id=3264752093]
module.discord_simde.discord_channel_permission.treso_notifications: Refreshing state... [id=3519343031]
module.discord_simde.discord_channel_permission.games_member: Refreshing state... [id=1359208525]
module.discord_simde.discord_channel_permission.member_notifications: Refreshing state... [id=3123474663]
module.discord_simde.discord_channel_permission.jeffrey_notifications: Refreshing state... [id=4429080]
module.discord_simde.discord_channel_permission.jeffrey_general: Refreshing state... [id=2855812215]
module.discord_simde.module.general.discord_channel_permission.member[0]: Refreshing state... [id=2392492197]
module.discord_simde.module.private-payutc.discord_text_channel.text: Refreshing state... [id=776093859746676736]
module.discord_simde.module.private-treso.discord_channel_permission.member_denied[0]: Refreshing state... [id=2842734733]
module.discord_simde.module.private-treso.discord_channel_permission.admin[0]: Refreshing state... [id=4257400037]
module.discord_simde.module.private-payutc.discord_channel_permission.admin[0]: Refreshing state... [id=413852137]
module.discord_simde.module.private-payutc.discord_channel_permission.member_denied[0]: Refreshing state... [id=1276679553]
module.discord_simde.discord_channel_permission.payutc_payutc: Refreshing state... [id=3757225894]
module.discord_simde.module.private-jeffrey.discord_category_channel.category: Refreshing state... [id=782684808395489320]
module.discord_simde.module.private-payutc.discord_voice_channel.voice: Refreshing state... [id=778331769547391037]
module.discord_simde.discord_channel_permission.jeffrey_jeffrey: Refreshing state... [id=3014025369]
module.discord_simde.module.private-jeffrey.discord_channel_permission.admin[0]: Refreshing state... [id=1568403726]
module.discord_simde.module.private-jeffrey.discord_text_channel.text: Refreshing state... [id=782684809008775169]
module.discord_simde.module.private-jeffrey.discord_channel_permission.member_denied[0]: Refreshing state... [id=164201830]
module.discord_simde.module.private-admin.discord_category_channel.category: Refreshing state... [id=778331766016049173]
module.discord_simde.module.private-admin.discord_text_channel.text: Refreshing state... [id=759903971316858891]
module.discord_simde.module.private-admin.discord_channel_permission.member_denied[0]: Refreshing state... [id=3623255403]
module.discord_simde.module.private-admin.discord_channel_permission.admin[0]: Refreshing state... [id=2202274051]
module.discord_simde.module.private-jeffrey.discord_voice_channel.voice: Refreshing state... [id=782684810614538311]
module.discord_simde.module.private-admin.discord_voice_channel.voice: Refreshing state... [id=778331771556855838]
module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role["759778778212991066"]: Refreshing state... [id=2314042217]
module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role["776093666267758604"]: Refreshing state... [id=2314042217]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.github.github_branch_default.jeffrey will be created
  + resource "github_branch_default" "jeffrey" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "jeffrey"
    }

  # module.github.github_branch_default.jeffreyApi will be created
  + resource "github_branch_default" "jeffreyApi" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "jeffrey-api"
    }

  # module.github.github_branch_default.terraform will be created
  + resource "github_branch_default" "terraform" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "terraform"
    }

  # module.github.github_repository.jeffrey will be updated in-place
  ~ resource "github_repository" "jeffrey" {
        allow_merge_commit     = true
        allow_rebase_merge     = true
        allow_squash_merge     = true
        archived               = false
        auto_init              = false
        default_branch         = "master"
        delete_branch_on_merge = true
        description            = "Service de click&delivery associatif (et drole)"
        etag                   = "W/\"397d24530b5475b885d3324afbec750dfbc0598496fda4b011eef2fb46713c1e\""
        full_name              = "SiMDE-Projects/jeffrey"
        git_clone_url          = "git://github.com/SiMDE-Projects/jeffrey.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = true
        has_wiki               = false
        homepage_url           = "https://jeffrey.etu-utc.fr/"
        html_url               = "https://github.com/SiMDE-Projects/jeffrey"
        http_clone_url         = "https://github.com/SiMDE-Projects/jeffrey.git"
        id                     = "jeffrey"
        is_template            = false
        name                   = "jeffrey"
        node_id                = "MDEwOlJlcG9zaXRvcnkyOTgzNTI5Njg="
        private                = false
        ssh_clone_url          = "git@github.com:SiMDE-Projects/jeffrey.git"
        svn_url                = "https://github.com/SiMDE-Projects/jeffrey"
        topics                 = [
            "front",
        ]
        visibility             = "public"
      - vulnerability_alerts   = true -> null
    }

  # module.github.github_repository.jeffreyApi will be updated in-place
  ~ resource "github_repository" "jeffreyApi" {
        allow_merge_commit     = true
        allow_rebase_merge     = true
        allow_squash_merge     = true
        archived               = false
        auto_init              = false
        default_branch         = "master"
        delete_branch_on_merge = true
        description            = "Backend de jeffrey"
        etag                   = "W/\"687b2187942694afb44c94f4fec4cc5c0b747b946afbdec12a763e681f192a02\""
        full_name              = "SiMDE-Projects/jeffrey-api"
        git_clone_url          = "git://github.com/SiMDE-Projects/jeffrey-api.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = true
        has_wiki               = false
        html_url               = "https://github.com/SiMDE-Projects/jeffrey-api"
        http_clone_url         = "https://github.com/SiMDE-Projects/jeffrey-api.git"
        id                     = "jeffrey-api"
        is_template            = false
        name                   = "jeffrey-api"
        node_id                = "MDEwOlJlcG9zaXRvcnkzMDczMTA3Nzk="
        private                = false
        ssh_clone_url          = "git@github.com:SiMDE-Projects/jeffrey-api.git"
        svn_url                = "https://github.com/SiMDE-Projects/jeffrey-api"
        topics                 = [
            "api",
        ]
        visibility             = "public"
      - vulnerability_alerts   = true -> null
    }

  # module.github.github_repository.terraform will be updated in-place
  ~ resource "github_repository" "terraform" {
        allow_merge_commit     = true
        allow_rebase_merge     = true
        allow_squash_merge     = true
        archived               = false
        auto_init              = false
        default_branch         = "main"
        delete_branch_on_merge = true
        description            = "Définition IAC du SiMDE"
        etag                   = "W/\"f4abd78073c66398e2cd4f7a64c042605c6e181de598dd3fad1de5f9b64f042c\""
        full_name              = "SiMDE-Projects/terraform"
        git_clone_url          = "git://github.com/SiMDE-Projects/terraform.git"
        has_downloads          = false
        has_issues             = false
        has_projects           = false
        has_wiki               = false
        html_url               = "https://github.com/SiMDE-Projects/terraform"
        http_clone_url         = "https://github.com/SiMDE-Projects/terraform.git"
        id                     = "terraform"
        is_template            = false
        name                   = "terraform"
        node_id                = "MDEwOlJlcG9zaXRvcnkzMTMxNDY5ODE="
        private                = false
        repo_id                = 313146981
        ssh_clone_url          = "git@github.com:SiMDE-Projects/terraform.git"
        svn_url                = "https://github.com/SiMDE-Projects/terraform"
        topics                 = [
            "infrastructure-as-code",
        ]
        visibility             = "public"
      - vulnerability_alerts   = true -> null
    }

  # module.discord_simde.module.antoine_cet.discord_member_roles.member_role["759778776560828447"] will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "621730232365482004"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
    }

  # module.discord_simde.module.antoine_cet.discord_member_roles.member_role["781934406292996116"] will be destroyed
  - resource "discord_member_roles" "member_role" {
      - id        = "4264886267" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "621730232365482004" -> null

      - role {
          - has_role = true -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.private-admin.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331766016049173"
        name      = "private-admin"
      ~ position  = 4 -> 5
        server_id = "759778767831957535"
        type      = "category"
    }

  # module.discord_simde.module.private-woolly.discord_category_channel.category will be created
  + resource "discord_category_channel" "category" {
      + id        = (known after apply)
      + name      = "private-woolly"
      + position  = 4
      + server_id = "759778767831957535"
      + type      = "category"
    }

  # module.discord_simde.module.private-woolly.discord_channel_permission.admin[0] will be created
  + resource "discord_channel_permission" "admin" {
      + allow        = 100696136
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778778212991066"
      + type         = "role"
    }

  # module.discord_simde.module.private-woolly.discord_channel_permission.member_denied[0] will be created
  + resource "discord_channel_permission" "member_denied" {
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778776560828447"
      + type         = "role"
    }

  # module.discord_simde.module.private-woolly.discord_text_channel.text will be created
  + resource "discord_text_channel" "text" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-woolly"
      + nsfw                     = false
      + position                 = 0
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.discord_simde.module.private-woolly.discord_voice_channel.voice will be created
  + resource "discord_voice_channel" "voice" {
      + bitrate                  = 64000
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-woolly"
      + position                 = 1
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "voice"
    }

Plan: 9 to add, 4 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*